# MultiReferenceAnnotationReferenceCategoryForcesDeletion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MultiReferenceAnnotationFailures..::..MultiReferenceAnnotationReferenceCategoryForcesDeletion Property
BuiltInFailures..::..MultiReferenceAnnotationFailures Class See Also
---
Changing the reference category will cause instances of this annotation type to be deleted, because they no longer match their references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultiReferenceAnnotationReferenceCategoryForcesDeletion { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultiReferenceAnnotationReferenceCategoryForcesDeletion As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultiReferenceAnnotationReferenceCategoryForcesDeletion {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MultiReferenceAnnotationFailures Class
Autodesk.Revit.DB Namespace